[
  {
    "name": "Odi's Relentlessness",
    "type": "armour",
    "existing": [
      {
        "value": "Whenever you make an investigation check, you may spend a minute to also make a religion check and use the higher of the two results.",
        "upgradeable": false
      },
      {
        "value": "You have advantage on checks to learn creature stats",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "+1 intelligence"
      },
      {
        "value": "You can spend an action making an investigation or perception check. If you earn at least one question with this check, your next two attacks in this encounter are guaranteed to be critical hits.",
        "upgradeable": false
      },
      {
        "value": "When learning creature stats, you can sacrifice a question. If you do this, you and your allies deal +1 damage with all spells and attacks against that creature. This does not stack."
      },
      {
        "value": "You can make a disadvantaged check (of any appropriate type) to learn creature stats at the start of an encounter as a free action",
        "comment": "-> No disadvantage -> advantage"
      },
      {
        "value": "You have +1 AC when a creature targets you with an attack it has already used against you.",
        "comment": "+1 AC, max 2 AC"
      },
      {
        "value": "Whenever a creature succeeds a save against one of your spells, you learn its spell save bonus for all attributes",
        "upgradeable": false
      },
      {
        "value": "Once you have seen a creature cast a spell, you can spend an action to force it to make an Intelligence save against a DC of 8 + your prof + your INT Mod. On a failed save, the creature can't use that spell again for a minute, and you become able to use it once with Intelligence as the casting modifier.",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 1,
    "enabled": false
  },
  {
    "name": "Thatar's Soulthirst",
    "type": "weapon",
    "existing": [
      {
        "value": "You have advantage on attacks that would deal necrotic damage",
        "upgradeable": false
      },
      {
        "value": "For every effect that would target you, you may choose to be considered undead instead of humanoid",
        "upgradeable": false
      },
      {
        "value": "+3 resistance to damage from undead creatures",
        "comment": "+1"
      },
      {
        "value": "Once per long rest, when you kill a creature, you can choose to reanimate it for 1 round. While reanimated in this way, the creature cannot die, and it is completely under your control.",
        "comment": "+1 round"
      }
    ],
    "available": [
      {
        "value": "+1d4 necrotic damage with attacks with this weapon",
        "comment": "-> 1d6 -> 1d8 -> etc"
      },
      {
        "value": "You are resistant to necrotic damage",
        "upgradeable": false
      },
      {
        "value": "You learn the Finger of Death spell and may cast it once per long rest. Casting mod is a mental attribute of your choice.",
        "upgradeable": false
      },
      {
        "value": "Once per long rest, you may cast 1 spell slot worth of Necromany spells for without consuming a spell slot (you must still know the spell).",
        "comment": "When upgraded, can be used to cast 2x level 1 or 1x level 2, etc."
      },
      {
        "value": "Once per long rest, when killing a creature on your turn, you may immediately take another turn.",
        "comment": "More uses"
      }
    ],
    "found": true,
    "level": 3,
    "enabled": false
  },
  {
    "name": "Rislog's Ferocity",
    "type": "weapon",
    "existing": [
      {
        "value": "Attacks with this weapon cannot be disadvantaged",
        "upgradeable": false
      },
      {
        "value": "+2 weapon die size",
        "upgradeable": false
      },
      {
        "value": "+4 damage to melee and touch attacks",
        "comment": "+1"
      },
      {
        "value": "+1d8 piercing damage with attacks with this weapon",
        "comment": "Die size"
      },
      {
        "value": "If this weapon is a melee weapon, it is considered to have reach.",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "You may cast Wrathful Smite as a free action once per short rest. DC = 8 + AB for the attack that applied it.",
        "comment": "+1 uses per short rest"
      },
      {
        "value": "You and allies within 20 feet cannot be frightened if you have hit an enemy with this weapon in the last 2 rounds",
        "comment": "+5 feet, +1 round"
      },
      {
        "value": "If you are wielding a shield and have taken the attack action on your turn, you may make a bonus action to hit your target with your shield. They make a Strength saving throw against a DC of 8 + your prof + your STR Mod and are knocked prone on a failed save.",
        "upgradeable": false
      },
      {
        "value": "You may wield any weapon as if it were a light weapon, and you have proficiency with all weapons.",
        "upgradeable": false
      },
      {
        "value": "+4 damage against frightened enemies",
        "comment": "+3"
      },
      {
        "value": "+2 to saves and checks against non-magical grapples and restrains, including getting out from existing ones",
        "comment": "+1"
      },
      {
        "value": "Allies within 5 feet of your have +1 global damage"
      },
      {
        "value": "When you hit an enemy with more than one attack in a turn, you may also shove that target as a free action. You can do this [prof mod] times per long rest.",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 10,
    "enabled": false
  },
  {
    "name": "Cerasil's Protection",
    "type": "armour",
    "existing": [
      {
        "value": "+2 damage resistance while in sunlight",
        "comment": "+1"
      },
      {
        "value": "You are permanently under the effect of the Speak with Animals spell",
        "upgradeable": false
      },
      {
        "value": "+2 health regeneration per round of combat while outdoors and above 0 hit points"
      },
      {
        "value": "After you received damage for the first time in a combat, you become resistant to that damage type for the rest of the combat. You then become vulnerable to two other damage types (fire + thunder)."
      },
      {
        "value": "+1d4 poison melee thorns",
        "comment": "Die size"
      }
    ],
    "available": [
      {
        "value": "You may cast Animal Shapes once per long rest",
        "upgradeable": false
      },
      {
        "value": "You may cast Conjure Animal once per short rest",
        "upgradeable": false
      },
      {
        "value": "You have proficiency in the Nature skill. If you already have proficiency in Nature, you have expertise.",
        "comment": "prof -> expert -> advantage"
      },
      {
        "value": "You have proficiency in the Animal Handling skill. If you already have proficiency in Animal Handling, you have expertise.",
        "comment": "prof -> expert -> advantage"
      },
      {
        "value": "Beast and Plant creatures have disadvantage when attacking you",
        "upgradeable": false
      },
      {
        "value": "When you are hit, as a reaction, you may force the attacker to make a Constitution saving throw against a DC of 8 + your prof + your CON Mod. On a failed save, they are poisoned until the end of their turn.",
        "comment": "+1 DC"
      },
      {
        "value": "+4 poison damage resistance"
      },
      {
        "value": "You may cast Healing Spirit as a 3rd level spell once per short rest",
        "comment": "+1 slot level"
      }
    ],
    "found": true,
    "level": 4
  },
  {
    "name": "Ketis' Dominion",
    "type": "weapon",
    "existing": [
      {
        "value": "You may choose to convert all physical damage from this weapon to cold, fire, or lightning damage.",
        "upgradeable": false
      },
      {
        "value": "+1d8 lightning damage to attacks and spells"
      },
      {
        "value": "-2 critical strike requirement with attacks that would deal cold damage",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "Attacks with this weapon have advantage against targets that are vulnerable to cold, fire, or lightning damage.",
        "upgradeable": false
      },
      {
        "value": "+2 fire damage with attacks and spells, even if they don't deal fire damage already"
      },
      {
        "value": "Once per long rest, when you take cold, fire, or lightning damage, you can use a reaction to immediately take a full turn",
        "comment": "+1 uses"
      },
      {
        "value": "+1 cold, fire, and lightning damage"
      },
      {
        "value": "You may cast Conjure Elemental as a 5th level spell once per long rest",
        "comment": "+1 spell slot level used"
      },
      {
        "value": "Your critical strikes with this weapon deal double the amount of cold, fire, and lightning damage",
        "upgradeable": false
      },
      {
        "value": "You become acclimatised to both hot and cold weather",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 6
  },
  {
    "name": "Esher's Health",
    "type": "armour",
    "existing": [
      {
        "value": "+5 health",
        "comment": "+2 health on level"
      },
      {
        "value": "You are immune to diseases",
        "upgradeable": false
      },
      {
        "value": "Once per long rest, you can make a Persuasion check contested by a non-hostile creature's Wisdom save. The creature must be within 60 feet of you. On a success, you can give them a command as per the Command spell",
        "upgradeable": false
      },
      {
        "value": "+2 to outgoing healing"
      },
      {
        "value": "After you received damage for the first time in a combat, you become resistant to that damage type for the rest of the combat. You then become vulnerable to Necrotic and Thunder damage."
      }
    ],
    "available": [
      {
        "value": "+1 Constitution"
      },
      {
        "value": "+2 maximum hit dice",
        "comment": "+1"
      },
      {
        "value": "You have proficiency in the Medicine skill. If you already have proficiency in Medicine, you have expertise.",
        "comment": "prof -> expert -> advantage"
      },
      {
        "value": "+1 to death saves, -1 to death save critical requirement. You cannot get a critical failure with death saves.",
        "comment": "both +1 and -1"
      },
      {
        "value": "+3 to outgoing healing",
        "comment": "+2"
      },
      {
        "value": "+2 to incoming healing",
        "comment": "+1"
      },
      {
        "value": "You can cast Greater Restoration once per long rest"
      },
      {
        "value": "+1 resistance to all damage"
      },
      {
        "value": "If this mod gets to level 3, you gain the Tough feat. Current level: 1"
      }
    ],
    "found": true,
    "level": 3
  },
  {
    "name": "Jemima's Forgery",
    "type": "armour",
    "existing": [
      {
        "value": "+2 physical damage resistance"
      }
    ],
    "available": [
      {
        "value": "+1 AC if you have heavy armour proficiency"
      },
      {
        "value": "+1 physical damage"
      },
      {
        "value": "You may take an additional reaction if you received damage in the last round",
        "upgradeable": false
      },
      {
        "value": "-1 melee critical strike requirement"
      },
      {
        "value": "When hit by a melee attack, you can use a reaction to force the attacker to make a save against a DC of 8 + prof + your STR mod. On a failed save, their turn ends."
      },
      {
        "value": "When you block a melee attack, you can make a headbutt as a reaction. Deal 1+STR MOD bludgeoning damage.",
        "comment": "+1 damage"
      },
      {
        "value": "+1 Strength"
      },
      {
        "value": "You become proficient with heavy armour",
        "upgradeable": false
      },
      {
        "value": "You become proficient with martial weapons",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 2,
    "enabled": true
  },
  {
    "name": "Tea's Gratitude",
    "type": "armour",
    "existing": [
      {
        "value": "+2 damage with attacks against surprised targets",
        "comment": "Original"
      },
      {
        "value": "Once per short rest, you may disengage as a free action",
        "comment": "free action instead of bonus",
        "upgradeable": false
      },
      {
        "value": "+1 to damage with light weapons"
      }
    ],
    "available": [
      {
        "value": "You always have advantage on Stealth",
        "upgradeable": false
      },
      {
        "value": "You always have advantage on Sleight of Hand",
        "upgradeable": false
      },
      {
        "value": "+1 dexterity while wearing a stolen item (owner must be alive at time of theft)."
      },
      {
        "value": "You have expertise in deception when in regards to crimes you have committed.",
        "upgradeable": false
      },
      {
        "value": "+1d4 damage against flanked enemies"
      },
      {
        "value": "When rolling more than one mod on a magic item (crafting or finding double enchanted item), you may roll another mod and choose to ignore one",
        "upgradeable": false
      },
      {
        "value": "+1 to all dexterity skills and saves"
      },
      {
        "value": "You cannot be surprised",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 4,
    "enabled": true
  },
  {
    "name": "Erin's Infestation",
    "type": "armour",
    "existing": [
      {
        "value": "Once per short rest, as an action, you may cast Find Familiar, but the familiar must be a rat",
        "upgradeable": false
      },
      {
        "value": "You need four failed death save points to die, instead of 3",
        "upgradeable": false
      },
      {
        "value": "Your critical strikes add 1 additional damage die from the source's base damage",
        "upgradeable": false
      },
      {
        "value": "If your current amulet is at least CR3, in addition to your regular amulet, you are always considered to be wearing an amulet that contains a Rat King (ToB 318). Using this is independent of your other amulet's uses.",
        "upgradeable": false
      },
      {
        "value": "Once per short rest, while transformed into a Monstrosity, you may take two actions instead of one on your turn."
      }
    ],
    "available": [
      {
        "value": "+3 animal handling",
        "comment": "+1"
      },
      {
        "value": "You have advantage on Wisdom (Perception) checks that rely on smell",
        "upgradeable": false
      },
      {
        "value": "+2 resistance to all damage while you have at least 3 allies within 60 feet of you, including minions (yours and other allies')",
        "comment": "player choice: +1 res or -1 ally requirement"
      },
      {
        "value": "You may cast Mirror Image once per short rest",
        "comment": "+1 uses"
      },
      {
        "value": "+3 resistance to poison damage",
        "comment": "+1"
      },
      {
        "value": "You can move freely through enemy spaces",
        "upgradeable": false
      },
      {
        "value": "+1 piercing damage"
      },
      {
        "value": "When you hit an enemy with an attack, they must make a Constitution save against a DC of that attack's AB. On a failed save, they gain one point of exhaustion. On a successful save, they become immune to future attempts at increasing their exhaustion in this way."
      }
    ],
    "found": true,
    "level": 5,
    "enabled": true
  },
  {
    "name": "Neldor's Treasure",
    "type": "ring",
    "existing": [
      {
        "value": "You may always ignore difficult terrain",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "Your movement cannot be reduced to 0 by non-magical effects (including grapple/restraint). Instead, it will remain at 5 feet.",
        "upgradeable": false
      },
      {
        "value": "When you find more than 1 of a crafting item, you find one additional item of that type",
        "upgradeable": false
      },
      {
        "value": "+1 to your saves when avoiding conditions",
        "upgradeable": false
      },
      {
        "value": "As a free action when learning about a creature, you may also learn one of its save bonuses",
        "upgradeable": false
      },
      {
        "value": "-1 save critical requirement (i.e. 20 -> 19)",
        "comment": "No more than 2 upgrades"
      },
      {
        "value": "Once per short rest, you can make a save to end a condition at the start of your turn instead of at the end",
        "comment": "More uses"
      },
      {
        "value": "If you upgrade or empower this mod, you gain one use of Legendary Resistance per long rest.",
        "comment": "Only upgradeable once"
      },
      {
        "value": "You can move at normal speed while prone"
      },
      {
        "value": "You gain 20 additional gold when finding gold from loot boxes",
        "comment": "+10"
      }
    ],
    "found": false,
    "level": 1,
    "enabled": false
  },
  {
    "name": "Naba's Power",
    "type": "weapon",
    "existing": [
      {
        "value": "You may convert any physical damage you deal with this weapon to lightning damage",
        "upgradeable": false
      },
      {
        "value": "Thrice per long rest, as a reaction to being hit by a creature within 60 feet from you, you may target them with the effects Lightning Lure (i.e. they are guaranteed to fail the save).",
        "comment": "+1 uses"
      },
      {
        "value": "When you become unconscious as a result of going down to 0 hit points, creatures of your choice within 5 feet of you must succeed a Constitution save against a DC of (8 + prof + attribute mod of your choice) or be stunned until the end of your next turn",
        "upgradeable": false
      },
      {
        "value": "+1d12 lightning damage with attacks with this weapon",
        "comment": "Die size"
      }
    ],
    "available": [
      {
        "value": "+2 lightning damage",
        "comment": "+1"
      },
      {
        "value": "+1 to the DC of spells and cantrips that would deal lightning damage"
      },
      {
        "value": "You may ignore lightning resistance",
        "comment": "res + immunity on upgrade"
      },
      {
        "value": "You become resistant to lightning damage",
        "upgradeable": false
      },
      {
        "value": "When you score a critical strike with this weapon, the target must succeed a CON save against a DC of half the lightning damage dealt or be stunned for 1 minute (repeat save at end of turns).",
        "comment": "+1 DC"
      },
      {
        "value": "You can cast call lightning once per long rest. Mental mod of your choice.",
        "comment": "+1 uses"
      },
      {
        "value": "Once per short rest, when you land a killing blow with this weapon, you may force creatures within 5 feet of the target to make a save against 8 + the AB for that attack. On a failed save, they are stunned until the end of your next turn.",
        "comment": "+1 uses"
      }
    ],
    "found": true,
    "level": 9,
    "enabled": true
  },
  {
    "name": "Barker's Innovation",
    "type": "armour",
    "existing": [
      {
        "value": "+15 feet flight speed"
      },
      {
        "value": "You may have an extra choice when levelling relics",
        "upgradeable": false
      },
      {
        "value": "When you deliver a Killing Blow, heal 5 hit points",
        "comment": "+2"
      },
      {
        "value": "When you level a relic attuned to you to level 10, you may level it again (normal level) for free",
        "comment": "More free levels"
      }
    ],
    "available": [
      {
        "value": "Whenever you use a crafting item with random effects, you can use it twice and choose your preferred result.",
        "upgradeable": false
      },
      {
        "value": "You may have an extra choice when levelling relics",
        "upgradeable": false
      },
      {
        "value": "When you level a relic attuned to you to level 10, you may level it again (normal level) for free",
        "comment": "More free levels"
      },
      {
        "value": "+2 to loot rolls result, -1 loot roll die size",
        "upgradeable": false
      },
      {
        "value": "Magic items you have crafted (excludes flux) can have up to 6 mods, instead of 5",
        "upgradeable": false
      },
      {
        "value": "Relics attuned to you only cost 75% of their regular price to level",
        "comment": "-5%"
      },
      {
        "value": "If flying is your highest speed, your flight does not provoke opportunity attacks",
        "upgradeable": false
      },
      {
        "value": "Your amulets are considered to be able to hold 1 CR higher",
        "comment": "1 upgrade max"
      },
      {
        "value": "+1 global damage for each relic you are wearing",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 4,
    "enabled": true
  },
  {
    "name": "Qhanas' Potency",
    "type": "armour",
    "existing": [
      {
        "value": "You become proficient in Arcana. If you are already proficient, you gain expertise.",
        "comment": "Expertise"
      },
      {
        "value": "Once per long rest, when you cast a spell that requires concentration, you may choose to not require concentration for its first minute. If you go unconscious, it would be as if you broke concentration.",
        "upgradeable": false
      },
      {
        "value": "+1 insight"
      },
      {
        "value": "If you take damage exceeding 25% of your maximum hit points in one round and do not reach 0 hit points by its end, you may move up one place in the initiative tracker, if possible."
      }
    ],
    "available": [
      {
        "value": "You have Legendary Resistance (once per long rest)",
        "upgradeable": false
      },
      {
        "value": "+10ft range with spells that have 10ft range or more",
        "comment": "+5ft"
      },
      {
        "value": "You are permanently under the effect of the Detect Magic spell, but with only a 10ft radius",
        "comment": "+10ft, max of spell's base (10)"
      },
      {
        "value": "+1 to your spell saves",
        "upgradeable": false
      },
      {
        "value": "+1 to your spell save DC",
        "upgradeable": false
      },
      {
        "value": "When a creature fails a spell save against a spell you cast, you learn its spell save bonus for all attributes",
        "upgradeable": false
      },
      {
        "value": "You become proficient in Intelligence or Charisma spell saving throws (does nothing if you are already proficient).",
        "upgradeable": false
      },
      {
        "value": "When a creature fails a spell save against your spell, or is hit by your spell attack, you gain temporary hit points equal to the spell slot level used",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 4,
    "enabled": true
  },
  {
    "name": "Ateus' Fortune",
    "type": "armour",
    "existing": [
      {
        "value": "You have 1 luck point (see Lucky feat for explanation). You regain your expended luck points when you finish a long rest.",
        "upgradeable": false
      },
      {
        "value": "Twice per long rest, you may choose to gain advantage on a loot roll"
      },
      {
        "value": "You have an additional second level spell slot (only if you already had at least 1)"
      }
    ],
    "available": [
      {
        "value": "This mod does nothing, but gain 400 gold when you choose it",
        "comment": "+100 gold for each choice. Current: 0"
      },
      {
        "value": "When you find any amount of a crafting item, gain an additional crafting item of that type"
      },
      {
        "value": "You have +1 on d8 and d10 loot rolls",
        "upgradeable": false
      },
      {
        "value": "You take no extra damage from critical strikes if you have dealt a critical strike in the last 12 seconds.",
        "upgradeable": false
      },
      {
        "value": "When you roll 1 on loot rolls, instead reroll with a d8",
        "comment": "d10, d12"
      },
      {
        "value": "Enemies that recharge abilities on a die roll have -1 to that die roll",
        "upgradeable": false
      },
      {
        "value": "+2 to critical loot roll rerolls",
        "comment": "Can't chain on unnatural 12"
      },
      {
        "value": "Enemies you critically strike provide an additional d10 loot roll (maximum 1 per creature)",
        "comment": "-> d12, max 1 upgrade"
      }
    ],
    "found": true,
    "level": 4,
    "enabled": true
  },
  {
    "name": "Indrai's Rescue",
    "type": "amulet",
    "existing": [
      {
        "value": "You cannot transform into a creature contained in this amulet unless it is a dragon",
        "comment": "Can be annulled/orb of destructioned",
        "upgradeable": false
      },
      {
        "value": "Starts at CR0. When used to combine XP, resulting amulet takes this one's mods.",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "+3 life while transformed into a dragon (after 20%)",
        "comment": "+2"
      },
      {
        "value": "+4 poison while transformed into a dragon",
        "comment": "+2"
      },
      {
        "value": "All of your speed types become as fast as your fastest speed while transformed into a dragon",
        "upgradeable": false
      },
      {
        "value": "Once per long rest, when you transform into a dragon, you may choose for that transformation to not count towards your transformation limit.",
        "upgradeable": false
      },
      {
        "value": "While you are transformed into a dragon, enemies that have damaged you while you were transformed into a dragon in the last minute are considered vulnerable to all of your damage",
        "upgradeable": false
      },
      {
        "value": "While this amulet contains a dragon, if requires 300XP fewer to be upgraded.",
        "upgradeable": false
      },
      {
        "value": "This amulet has an additional creature slot (independent CR scaling, starts at CR1). When transforming, if both creatures are dragons, you can choose to transform into either of them.",
        "upgradeable": false
      },
      {
        "value": "+1 to recharge rolls while transformed into a dragon",
        "upgradeable": false
      },
      {
        "value": "Once per long rest, if the contained creature is a dragon with a Dragon Breath attack, you can use it while not transformed."
      },
      {
        "value": "+1 to all damage while transformed into a dragon"
      },
      {
        "value": "If his amulet contains a dragon and that dragon's AC is higher than your AC would be without this mod, your AC is increased by 1.",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 1,
    "enabled": false
  },
  {
    "name": "Dilnis' Retribution",
    "type": "armour",
    "existing": [
      {
        "value": "You become resistant to cold damage",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "You can ignore opportunity attacks while underwater",
        "upgradeable": false
      },
      {
        "value": "+1d4 cold damage with melee attacks"
      },
      {
        "value": "+1d4 cold damage with ranged attacks"
      },
      {
        "value": "You may cast Control Water once per long rest",
        "comment": "More uses"
      },
      {
        "value": "At the end of your turn, enemies that have taken cold damage from you have -3 cold resistance until the start of your next turn",
        "comment": "-2 res"
      },
      {
        "value": "+15 feet swimming speed",
        "comment": "+10"
      },
      {
        "value": "You may ignore enemy cold resistance",
        "upgradeable": false
      },
      {
        "value": "You always know if a creature is immune/resistant/vulnerable to cold damage"
      },
      {
        "value": "You learn the shape water cantrip",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 1,
    "enabled": false
  },
  {
    "name": "Sagdor's Awakening",
    "type": "weapon",
    "existing": [
      {
        "value": "Enemies you critically strike (nat 20 or with reduced crit req) with this weapon become unconscious until the end of their next turn. This condition ends if they take damage, or if you become incapacitated.",
        "upgradeable": false
      },
      {
        "value": "-1 critical strike requirement with attacks that would deal psychic damage",
        "upgradeable": false
      },
      {
        "value": "+1d10 slashing damage with attacks with this weapon"
      },
      {
        "value": "Ignore lightning resistance",
        "upgradeable": false
      },
      {
        "value": "+2 to deception in languages other than Common"
      }
    ],
    "available": [
      {
        "value": "You may convert all damage from your ranged spell attacks to psychic damage",
        "upgradeable": false
      },
      {
        "value": "You learn the Vicious Mockery cantrip",
        "upgradeable": false
      },
      {
        "value": "+2 psychic damage",
        "comment": "+1"
      },
      {
        "value": "+1d4 psychic damage"
      },
      {
        "value": "+1d10 psychic damage against unconscious enemies",
        "upgradeable": false
      },
      {
        "value": "Once per long rest, when you summon an undead creature, that creature gains Undead Fortitude (DC 5 + damage taken unless radiant or crit)",
        "comment": "More uses"
      },
      {
        "value": "You learn the Catnap spell and may cast it once per long rest",
        "comment": "Upcast (3->4)"
      },
      {
        "value": "While you remain motionless, you are indistinguishable from an ordinary humanoid corpse.",
        "upgradeable": false
      },
      {
        "value": "Ranged attacks that would deal psychic damage ignore disadvantage from being in melee range of a hostile creature.",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 7,
    "enabled": true
  },
  {
    "name": "Ukt's Transformation",
    "type": "armour",
    "existing": [
      {
        "value": "You may cast Disguise Self once per long rest",
        "comment": "Uses"
      }
    ],
    "available": [
      {
        "value": "+1 damage against creatures that believe your disguise (with Disguise Self)"
      },
      {
        "value": "+2 stealth",
        "comment": "+1"
      },
      {
        "value": "+1 damage per killing blow you have landed today, to a maximum of 3",
        "comment": "Higher maximum"
      },
      {
        "value": "+3 deception while disguised if the target believes your disguise"
      },
      {
        "value": "+2 slashing damage with unarmed attacks",
        "comment": "+1"
      },
      {
        "value": "You cannot be charmed",
        "upgradeable": false
      },
      {
        "value": "+1 Dexterity",
        "upgradeable": false
      },
      {
        "value": "+2 to the DC of your Disguise Self spell when becoming disguised as a person you have spoken to before."
      },
      {
        "value": "+1 to the DC of your illusion spells",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 1,
    "enabled": false
  },
  {
    "name": "Nukk's Leadership",
    "type": "armour",
    "existing": [
      {
        "value": "Once per short rest, you may teleport over a 5 foot distance as part of your movement action.",
        "comment": "Extra uses"
      },
      {
        "value": "-1 critical strike requirement with attacks (including spell attacks)",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "+1 to the DCs of effects that would charm the target, or rely on the target to not be immune to charm"
      },
      {
        "value": "You ignore charm immunity",
        "upgradeable": false
      },
      {
        "value": "+1 health regeneration per round of combat while above 0 hit points"
      },
      {
        "value": "You may cast the darkness spell once per long rest",
        "upgradeable": false
      },
      {
        "value": "Creatures of your choice within 5 feet of you have +1 damage",
        "comment": "+range, max 15feet"
      },
      {
        "value": "+5 feet of Truesight",
        "comment": "+range, max 15feet"
      },
      {
        "value": "You may cast Disguise Self once per long rest, but you may also change 1 size in any direction."
      },
      {
        "value": "+1 slashing damage"
      },
      {
        "value": "Enemies that resist your damage also take 1 additional damage."
      }
    ],
    "found": true,
    "level": 1,
    "enabled": true
  },
  {
    "name": "Zardar's Insanity",
    "type": "armour",
    "existing": [
      {
        "value": "You are immune to diseases.",
        "upgradeable": false
      },
      {
        "value": "+1 AB with unarmed attacks"
      },
      {
        "value": "Gain temporary hit points equal to your lowest ability score (not bonus) at the beginning of each combat.",
        "upgradeable": false
      },
      {
        "value": "Once per round, when you take damage from a melee or touch attack, the attacker takes true damage equal to half your level, rounded down"
      }
    ],
    "available": [
      {
        "value": "+1 to your Constitution saving throws"
      },
      {
        "value": "Your size becomes large",
        "upgradeable": false
      },
      {
        "value": "+1 to your Necrotic damage"
      },
      {
        "value": "Your darkvision also allows you to see in pitch black darkness"
      },
      {
        "value": "Your critical strikes also apply a -1 Constitution penalty for 1 minute"
      },
      {
        "value": "You learn the Cloudkill spell",
        "upgradeable": false
      },
      {
        "value": "+1 intelligence"
      },
      {
        "value": "Once per long rest, when you take poison damage or necrotic damage, you may choose to ignore it.",
        "upgradeable": false
      },
      {
        "value": "Creatures you score a critical strike against make a CON save against a DC of 8 + the attack's AB. On a failed save, +1d8 loot roll from that creature.",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 3,
    "enabled": true
  },
  {
    "name": "Crikath's Remains",
    "type": "armour",
    "existing": [
      {
        "value": "You cannot be blinded, but you may still be considered blind in darkness.",
        "upgradeable": false
      },
      {
        "value": "+1 AC",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "+1 damage with ranged attacks while not on full life",
        "comment": "+1"
      },
      {
        "value": "You take half damage from Ooze creatures.",
        "upgradeable": false
      },
      {
        "value": "Other creatures you buff have +2 damage for the duration of the buff.",
        "upgradeable": false
      },
      {
        "value": "+2 radiant damage",
        "comment": "+1"
      },
      {
        "value": "+2 damage with spells if you used the attack action in your previous turn in the combat",
        "comment": "+1"
      },
      {
        "value": "+1 damage with cantrips"
      },
      {
        "value": "+1 AC while unarmoured",
        "comment": "Max +2 AC"
      },
      {
        "value": "+1AB while mounted",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 2,
    "enabled": true
  },
  {
    "name": "Aurifex' Craft",
    "type": "weapon",
    "existing": [
      {
        "value": "You may use a d8 instead of a d6 when using an Orb of Purification",
        "upgradeable": false
      },
      {
        "value": "+1d6 global true damage",
        "upgradeable": false
      },
      {
        "value": "The CR capacity of amulets you find is at least 1. If you find one with a lower capacity, it is instead considered to be 1",
        "upgradeable": false
      },
      {
        "value": "When you get this mod to level 2, it will grant +1 damage for each other relic you are wearing."
      }
    ],
    "available": [
      {
        "value": "-100 XP required to level up an amulet,",
        "upgradeable": false
      },
      {
        "value": "When you get a currency item from *your* loot roll, you also gain another d10 loot roll.",
        "upgradeable": false
      },
      {
        "value": "+1 damage to your attacks with this weapon for attack already made this turn (so +0, +1, +2, etc).",
        "upgradeable": false
      },
      {
        "value": "You ignore enemy resistances, but not immunities, while transformed.",
        "comment": "Also immunities"
      },
      {
        "value": "You learn the Shield spell and may cast it once per long rest",
        "comment": "Short rest instead of long rest, max 1 upgrade"
      }
    ],
    "found": true,
    "level": 5,
    "enabled": true
  },
  {
    "name": "Morah's Love",
    "type": "armour",
    "existing": [
      {
        "value": "+1 Charisma",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "+2 deception"
      },
      {
        "value": "You may cast Ceremony once per long rest"
      },
      {
        "value": "You may cast Calm Emotions once per long rest"
      },
      {
        "value": "Once per long rest, you may choose a willing intelligent creature. For the next hour, you can communicate with this creature telepathically over any distance in the same plane.",
        "upgradeable": false
      },
      {
        "value": "You may cast Hallow once per long rest, but you may only use the Courage feature."
      },
      {
        "value": "You may cast Sending once per long rest. The spell has no verbal or somatic components when cast in this way.",
        "upgradeable": false
      },
      {
        "value": "Once per long rest, the first time you are attacked by a creature, you may target them with the Charm Monster spell as a reaction.",
        "upgradeable": false
      },
      {
        "value": "Once per short rest, when an ally goes down in combat, you may use your reaction to take an action.",
        "upgradeable": false
      },
      {
        "value": "When this mod is empowered twice, you gain the Inspiring Leader feat.",
        "comment": "Current: 0 (2 grants feat)"
      }
    ],
    "found": false,
    "level": 1,
    "enabled": true
  },
  {
    "name": "Culad's Freedom",
    "type": "armour",
    "existing": [
      {
        "value": "You have telepathy with a range of 60 feet. You must be able to speak a language the target understands.",
        "comment": "+30 feet, max 120"
      },
      {
        "value": "-1 critical strike requirement with attacks (including spell attacks)",
        "upgradeable": false
      },
      {
        "value": "While wearing this item, you are proficient in all languages.",
        "upgradeable": false
      },
      {
        "value": "If you take damage exceeding 25% of your maximum hit points in one round and do not reach 0 hit points by its end, you may move up one place in the initiative tracker, if possible.",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "+2 to recharge rolls while transformed into a Celestial",
        "comment": "+1"
      },
      {
        "value": "+15 feet speed while flying (does not increase 0 to 15)",
        "comment": "+5"
      },
      {
        "value": "You have Flyby",
        "upgradeable": false
      },
      {
        "value": "+5 feet flying speed",
        "comment": "+5"
      },
      {
        "value": "Once per short rest, when you hit an enemy with an attack, yuo can also force them to make a Strength save (DC 8 + AB). On a fail, the creature is pushed back 5 feet and knocked prone.",
        "comment": "+5 feet push distance distance"
      },
      {
        "value": "You learn the Cure Wounds spell. You may cast it an additional 2 times per long rest.",
        "comment": "+1 uses"
      },
      {
        "value": "You have advantage on Wisdom (Perception) checks that rely on sight. (Keen Sight)",
        "upgradeable": false
      },
      {
        "value": "You become resistant to radiant damage",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 4,
    "enabled": true
  },
  {
    "name": "Falynn's Trust",
    "type": "armour",
    "existing": [
      {
        "value": "+1 Charisma",
        "upgradeable": false
      },
      {
        "value": "Once per short rest, you may take the help action as a bonus action.",
        "comment": "+1 uses"
      }
    ],
    "available": [
      {
        "value": "+1 Charisma"
      },
      {
        "value": "You become proficient in two skills of your choice",
        "upgradeable": false
      },
      {
        "value": "Once per long rest, when you fail a Charisma, Intelligence, or Wisdom saving throw, you may choose to try again.",
        "comment": "+1"
      },
      {
        "value": "CHA mod times per long rest, when making a persuasion check, you can guarantee that a target will not think you are lying, although they may still think you're wrong.",
        "upgradeable": false
      },
      {
        "value": "+1 to all social checks (Insight + Charisma checks)",
        "upgradeable": false
      },
      {
        "value": "Allied creatures within 5 feet of have +1 resistance to damage",
        "upgradeable": false
      },
      {
        "value": "You may use Bardic Inspiration, with level-appropriate die size, once per long rest.",
        "upgradeable": false
      },
      {
        "value": "Your allies have +1 initiative.",
        "upgradeable": false
      }
    ],
    "found": true,
    "level": 2,
    "enabled": true
  },
  {
    "name": "Vuneta's Peace",
    "type": "armour",
    "existing": [
      {
        "value": "+1 resistance to damage dealt by creatures you have not damaged",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "Condition you inflict required +1 DC to escape. The DC returns to normal if the creature is damaged.",
        "comment": "max +2"
      },
      {
        "value": "Creatures you choose within 30 feet of you that have reduced a creature to 0HP recently have -1AB.",
        "comment": "max +2"
      },
      {
        "value": "You may cast the Calm Emotions spell once per short rest."
      },
      {
        "value": "You may cast Beacon of Hope once per long rest. When cast in this way, the spell does not require concentration, but still ends if you become incapacitated.",
        "upgradeable": false
      },
      {
        "value": "+2 AC if you have not acted in combat yet.",
        "upgradeable": false
      },
      {
        "value": "Once per short rest, target a creature you have damaged, you may cast Cure Wounds as a bonus action.",
        "comment": "Spell level"
      },
      {
        "value": "Feeding others potions requires a bonus action instead of an action.",
        "upgradeable": false
      },
      {
        "value": "You may cast Wall of Sand once per long rest. When cast in this way, it lasts for 24 hours instead of 10 minutes.",
        "upgradeable": false
      },
      {
        "value": "Creatures you have healed in the last hour have disadvantage against your charms",
        "upgradeable": false
      }
    ],
    "found": false,
    "level": 1,
    "enabled": true
  },
  {
    "name": "Redacted's Control",
    "type": "armour",
    "existing": [
      {
        "value": "+1 performance and +1 intimidation"
      },
      {
        "value": "You may cast the Scrying spell twice per long rest"
      }
    ],
    "available": [
      {
        "value": "Once per long rest, when you make a Sleight of Hand check, you can replace the number roll with a 10.",
        "upgradeable": false
      },
      {
        "value": "You may cast the Glibness spell once per long rest",
        "upgradeable": false
      },
      {
        "value": "+1 AB with attacks of opportunity",
        "comment": "Max +2AB"
      },
      {
        "value": "You are considered to be proficient in all Charisma checks while under the effect of a Divination spell you have cast (does not work with cantrips)",
        "upgradeable": false
      },
      {
        "value": "+1 to your rolls when rolling for downtime activities"
      },
      {
        "value": "10% reduced cost of downtime activities"
      }
    ],
    "found": true,
    "level": 3,
    "enabled": false
  },
  {
    "name": "Tremor Gang's Cooperation",
    "type": "weapon",
    "existing": [
      {
        "value": "+1 global damage while within 15 feet of at least 2 conscious allies",
        "comment": "+5ft radius"
      },
      {
        "value": "+1 Dexterity",
        "comment": "upgradeable once"
      },
      {
        "value": "Once per short rest, when you land a critical hit with this weapon, you may choose to instead land a regular hit, but guarantee the next attack of an ally you can see is a critical hit (upgraded).",
        "comment": "-1 critical strike chance with this weapon, but your criticals must be transferred.",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "Once per long rest, when casting a spell, you may upcast it to 5th level while still only consuming the original spell slot. The spell must be of at least 3rd level.",
        "comment": "-1 spell minimum"
      },
      {
        "value": "You learn thief's cant",
        "upgraded": false
      },
      {
        "value": "+1d4 damage with this weapon while flanking",
        "comment": "Die size"
      },
      {
        "value": "Once per long rest, as a touch spell on a willing creature, you may grant that creature the ability to cast Find Steed until your next long rest.",
        "upgraded": false
      },
      {
        "value": "+10 feet to the range of your spells that already have a range of at least 10 feet",
        "comment": "+5ft"
      },
      {
        "value": "Once per short rest, when dealing damage with this weapon, you may instead heal an ally within 15 feet of you half that amount",
        "comment": "+5ft radius"
      },
      {
        "value": "Creatures you hit with this weapon take +1 damage from all sources of damage for the next minute (does not stack)",
        "upgraded": false
      },
      {
        "value": "You may cast Branding Smite once per long rest. When cast in this way, the effect can only come from attacks with this weapon, and the spell does not require concentration until after the effect is applied",
        "upgraded": false
      }
    ],
    "found": true,
    "level": 5,
    "enabled": true
  },
  {
    "name": "Fext's Force",
    "type": "weapon",
    "existing": [
      {
        "value": "+1 AB with attacks that would deal force damage",
        "comment": "Max +2"
      }
    ],
    "available": [
      {
        "value": "You may cast the Hex spell once per short rest",
        "comment": "Once per initiative roll -> at will"
      },
      {
        "value": "Your ranged attacks that would deal force damage do not suffer from disadvantage as a result of being in melee range",
        "upgradeable": false
      },
      {
        "value": "Once per combat, until the end of the combat when you deal a Killing Blow, you gain the ability to cast Fear as a free action once",
        "upgradeable": false
      },
      {
        "value": "Once per short rest, you may cast Counterspell against a creature you have damaged in the last minute.",
        "upgradeable": false
      },
      {
        "value": "Once per round, you may convert all physical damage from an attack or spell to force damage",
        "comment": "At will"
      },
      {
        "value": "+1d4 force damage with attacks with this weapon. Applies to all attacks when upgraded.",
        "comment": "All attacks -> die size"
      },
      {
        "value": "Your Charisma modifier is added to your AC, to a minimum of 0 and a maximum of 1",
        "comment": "Max +1"
      },
      {
        "value": "You are immune to paralysis",
        "upgradeable": false
      }
    ],
    "found": false,
    "level": 1,
    "enabled": true
  },
  {
    "name": "Laekces' Infection",
    "type": "weapon",
    "existing": [
      {
        "value": "This weapon can shoot out acid, allowing you to use it at range (10/20ft), converting all of its base damage to acid",
        "comment": "10ft range each"
      }
    ],
    "available": [
      {
        "value": "Critical strikes that deal poison damage with this weapon also apply a poison that last's until the end of the target's next turn",
        "upgradeable": false
      },
      {
        "value": "You become immune to the poisoned condition",
        "upgradeable": false
      },
      {
        "value": "+1d6 poison damage with this weapon"
      },
      {
        "value": "Enemies within 10 feet of you take 1 poison damage at the start of their turn",
        "comment": "+1, max 2"
      },
      {
        "value": "Once per short rest, when you deal acid damage, you may forgo dealing that damage. Instead, the target takes that damage at the end of its next two turns.",
        "comment": "+1 turn, max 3"
      },
      {
        "value": "Once per turn, if you have taken poison damage in the last round, you may gain advantage on an attack.",
        "upgradeable": false
      },
      {
        "value": "You learn the Bestow Curse spell and may cast it once per short rest (metal att of choice).",
        "upgradeable": false
      },
      {
        "value": "When using a bonus action to learn a creature's stats, you always learn its res/vuln/imm to acid and poison, even if you earned no questions.",
        "upgradeable": false
      }
    ],
    "found": false,
    "level": 1,
    "enabled": true
  },
  {
    "name": "Template",
    "type": "weapon/armour",
    "existing": [
      {
        "value": "effect",
        "upgradeable": false
      }
    ],
    "available": [
      {
        "value": "upgradeableEffect"
      }
    ],
    "found": false,
    "level": 1,
    "enabled": false
  }
]
