[
  {
    "value": "As a reaction, you may gain advantage on a save against becoming paralysed.",
    "weighting": 5
  },
  {
    "value": "As a reaction, you may gain advantage on a save against becoming unconscious (does not work when going down)."
  },
  {
    "value": "As a reaction, you may gain advantage on a save against becoming blinded."
  },
  {
    "value": "As a reaction, you may gain advantage on a save against becoming charmed."
  },
  {
    "value": "As a reaction, you may gain advantage on a save against becoming deafened.",
    "weighting": 20
  },
  {
    "value": "As a reaction, you may gain advantage on a save against becoming frightened."
  },
  {
    "value": "As a reaction, you may gain advantage on a save against becoming grappled."
  },
  {
    "value": "As a reaction, you may gain advantage on a save against becoming petrified.",
    "weighting": 5
  },
  {
    "value": "As a reaction, you may gain advantage on a save against becoming poisoned."
  },
  {
    "value": "As a reaction, you may gain advantage on a save against being knocked prone."
  },
  {
    "value": "As a reaction, you may gain advantage on a save against becoming restrained."
  },
  {
    "value": "As a reaction, you may gain advantage on a save against becoming stunned."
  },
  {
    "value": "As a reaction, you may gain advantage on a save against becoming incapacitated (does not include conditions where incapacitated is a side-effect)."
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'paralysed' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action.",
    "weighting": 5
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'blinded' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action."
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'charmed' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action."
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'deafened' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action.",
    "weighting": 20
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'frightened' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action."
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'grappled' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action."
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'petrified' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action."
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'poisoned' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action."
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'prone' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action."
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'restrained' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action."
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'stunned' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action."
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'unconscious' condition to make that save with disadvantage. This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action.",
    "weighting": 5
  },
  {
    "value": "You may spend an action to cause targets of your next effect that can cause the 'incapacitated' condition to make that save with disadvantage (this does not include conditions where incapacitated is a side-effect). This does not work if a minute has passed since you sacrificed your action. Alternatively, you  may gain advantage and sacrifice your next action."
  },
  {
    "value": "+4 damage against paralysed enemies"
  },
  {
    "value": "+4 damage against blinded enemies"
  },
  {
    "value": "+4 damage against charmed enemies"
  },
  {
    "value": "+4 damage against deafened enemies"
  },
  {
    "value": "+4 damage against frightened enemies"
  },
  {
    "value": "+4 damage against grappled enemies",
    "weighting": 8
  },
  {
    "value": "+4 damage against petrified enemies"
  },
  {
    "value": "+4 damage against poisoned enemies"
  },
  {
    "value": "+4 damage against prone enemies",
    "weighting": 9
  },
  {
    "value": "+4 damage against restrained enemies"
  },
  {
    "value": "+4 damage against stunned enemies"
  },
  {
    "value": "+4 damage against unconscious enemies"
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'paralysed' condition",
    "weighting": 5
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'blinded' condition",
    "weighting": 5
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'charmed' condition",
    "weighting": 5
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'deafened' condition",
    "weighting": 5
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'frightened' condition",
    "weighting": 5
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'grappled' condition",
    "weighting": 5
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'petrified' condition",
    "weighting": 5
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'poisoned' condition",
    "weighting": 5
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'prone' condition",
    "weighting": 5
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'restrained' condition",
    "weighting": 5
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'stunned' condition",
    "weighting": 5
  },
  {
    "value": "+1 to the DC of your effects that can cause the 'unconscious' condition",
    "weighting": 5
  }
]
